espressif/esp-idf/components/soc/esp32h4/register/soc/lp_clkrst_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_CLKRST_LP_CLK_CONF_REG register
 *  Configures the root clk of LP system
 */
#define LP_CLKRST_LP_CLK_CONF_REG (DR_REG_LP_CLKRST_BASE + 0x0)
/** LP_CLKRST_SLOW_CLK_SEL : R/W; bitpos: [1:0]; default: 0;
 *  Configures the source of LP_SLOW_CLK.
 *  0: RC_SLOW_CLK
 *  1: XTAL32K_CLK
 *  2: RC32K_CLK
 *  3:OSC_SLOW_CLK
 */
#define LP_CLKRST_SLOW_CLK_SEL    0x00000003U
#define LP_CLKRST_SLOW_CLK_SEL_M  (LP_CLKRST_SLOW_CLK_SEL_V << LP_CLKRST_SLOW_CLK_SEL_S)
#define LP_CLKRST_SLOW_CLK_SEL_V  0x00000003U
#define LP_CLKRST_SLOW_CLK_SEL_S  0
/** LP_CLKRST_FAST_CLK_SEL : R/W; bitpos: [2]; default: 1;
 *  configures the source of LP_FAST_CLK.
 *  0: RC_FAST_CLK
 *  1: XTAL_D2_CLK
 */
#define LP_CLKRST_FAST_CLK_SEL    (BIT(2))
#define LP_CLKRST_FAST_CLK_SEL_M  (LP_CLKRST_FAST_CLK_SEL_V << LP_CLKRST_FAST_CLK_SEL_S)
#define LP_CLKRST_FAST_CLK_SEL_V  0x00000001U
#define LP_CLKRST_FAST_CLK_SEL_S  2
/** LP_CLKRST_LP_PERI_DIV_NUM : R/W; bitpos: [10:3]; default: 0;
 *  reserved
 */
#define LP_CLKRST_LP_PERI_DIV_NUM    0x000000FFU
#define LP_CLKRST_LP_PERI_DIV_NUM_M  (LP_CLKRST_LP_PERI_DIV_NUM_V << LP_CLKRST_LP_PERI_DIV_NUM_S)
#define LP_CLKRST_LP_PERI_DIV_NUM_V  0x000000FFU
#define LP_CLKRST_LP_PERI_DIV_NUM_S  3

/** LP_CLKRST_LP_CLK_PO_EN_REG register
 *  Configures the clk gate to pad
 */
#define LP_CLKRST_LP_CLK_PO_EN_REG (DR_REG_LP_CLKRST_BASE + 0x4)
/** LP_CLKRST_AON_SLOW_OEN : R/W; bitpos: [0]; default: 1;
 *  Configures the clock gate to pad of the LP_DYN_SLOW_CLK.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_AON_SLOW_OEN    (BIT(0))
#define LP_CLKRST_AON_SLOW_OEN_M  (LP_CLKRST_AON_SLOW_OEN_V << LP_CLKRST_AON_SLOW_OEN_S)
#define LP_CLKRST_AON_SLOW_OEN_V  0x00000001U
#define LP_CLKRST_AON_SLOW_OEN_S  0
/** LP_CLKRST_AON_FAST_OEN : R/W; bitpos: [1]; default: 1;
 *  Configures the clock gate to pad of the LP_DYN_FAST_CLK.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_AON_FAST_OEN    (BIT(1))
#define LP_CLKRST_AON_FAST_OEN_M  (LP_CLKRST_AON_FAST_OEN_V << LP_CLKRST_AON_FAST_OEN_S)
#define LP_CLKRST_AON_FAST_OEN_V  0x00000001U
#define LP_CLKRST_AON_FAST_OEN_S  1
/** LP_CLKRST_SOSC_OEN : R/W; bitpos: [2]; default: 1;
 *  Configures the clock gate to pad of the OSC_SLOW_CLK.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_SOSC_OEN    (BIT(2))
#define LP_CLKRST_SOSC_OEN_M  (LP_CLKRST_SOSC_OEN_V << LP_CLKRST_SOSC_OEN_S)
#define LP_CLKRST_SOSC_OEN_V  0x00000001U
#define LP_CLKRST_SOSC_OEN_S  2
/** LP_CLKRST_FOSC_OEN : R/W; bitpos: [3]; default: 1;
 *  Configures the clock gate to pad of the RC_FAST_CLK.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_FOSC_OEN    (BIT(3))
#define LP_CLKRST_FOSC_OEN_M  (LP_CLKRST_FOSC_OEN_V << LP_CLKRST_FOSC_OEN_S)
#define LP_CLKRST_FOSC_OEN_V  0x00000001U
#define LP_CLKRST_FOSC_OEN_S  3
/** LP_CLKRST_OSC32K_OEN : R/W; bitpos: [4]; default: 1;
 *  Configures the clock gate to pad of the RC32K_CLK.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_OSC32K_OEN    (BIT(4))
#define LP_CLKRST_OSC32K_OEN_M  (LP_CLKRST_OSC32K_OEN_V << LP_CLKRST_OSC32K_OEN_S)
#define LP_CLKRST_OSC32K_OEN_V  0x00000001U
#define LP_CLKRST_OSC32K_OEN_S  4
/** LP_CLKRST_XTAL32K_OEN : R/W; bitpos: [5]; default: 1;
 *  Configures the clock gate to pad of the XTAL32K_CLK.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_XTAL32K_OEN    (BIT(5))
#define LP_CLKRST_XTAL32K_OEN_M  (LP_CLKRST_XTAL32K_OEN_V << LP_CLKRST_XTAL32K_OEN_S)
#define LP_CLKRST_XTAL32K_OEN_V  0x00000001U
#define LP_CLKRST_XTAL32K_OEN_S  5
/** LP_CLKRST_CORE_EFUSE_OEN : R/W; bitpos: [6]; default: 1;
 *  Configures the clock gate to pad of the EFUSE_CTRL clock.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_CORE_EFUSE_OEN    (BIT(6))
#define LP_CLKRST_CORE_EFUSE_OEN_M  (LP_CLKRST_CORE_EFUSE_OEN_V << LP_CLKRST_CORE_EFUSE_OEN_S)
#define LP_CLKRST_CORE_EFUSE_OEN_V  0x00000001U
#define LP_CLKRST_CORE_EFUSE_OEN_S  6
/** LP_CLKRST_SLOW_OEN : R/W; bitpos: [7]; default: 1;
 *  Configures the clock gate to pad of the LP_SLOW_CLK.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_SLOW_OEN    (BIT(7))
#define LP_CLKRST_SLOW_OEN_M  (LP_CLKRST_SLOW_OEN_V << LP_CLKRST_SLOW_OEN_S)
#define LP_CLKRST_SLOW_OEN_V  0x00000001U
#define LP_CLKRST_SLOW_OEN_S  7
/** LP_CLKRST_FAST_OEN : R/W; bitpos: [8]; default: 1;
 *  Configures the clock gate to pad of the LP_FAST_CLK.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_FAST_OEN    (BIT(8))
#define LP_CLKRST_FAST_OEN_M  (LP_CLKRST_FAST_OEN_V << LP_CLKRST_FAST_OEN_S)
#define LP_CLKRST_FAST_OEN_V  0x00000001U
#define LP_CLKRST_FAST_OEN_S  8
/** LP_CLKRST_RNG_OEN : R/W; bitpos: [9]; default: 1;
 *  Configures the clock gate to pad of the RNG clk.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_RNG_OEN    (BIT(9))
#define LP_CLKRST_RNG_OEN_M  (LP_CLKRST_RNG_OEN_V << LP_CLKRST_RNG_OEN_S)
#define LP_CLKRST_RNG_OEN_V  0x00000001U
#define LP_CLKRST_RNG_OEN_S  9
/** LP_CLKRST_LPBUS_OEN : R/W; bitpos: [10]; default: 1;
 *  Configures the clock gate to pad of the LP bus clk.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_LPBUS_OEN    (BIT(10))
#define LP_CLKRST_LPBUS_OEN_M  (LP_CLKRST_LPBUS_OEN_V << LP_CLKRST_LPBUS_OEN_S)
#define LP_CLKRST_LPBUS_OEN_V  0x00000001U
#define LP_CLKRST_LPBUS_OEN_S  10

/** LP_CLKRST_LP_CLK_EN_REG register
 *  Configure LP root clk source gate
 */
#define LP_CLKRST_LP_CLK_EN_REG (DR_REG_LP_CLKRST_BASE + 0x8)
/** LP_CLKRST_RTC_BLE_TIMER_APB_GATE : R/W; bitpos: [27]; default: 1;
 *  Configures the clock gate to RTC_BLE_TIMER_APB_CLK
 *  0: Invalid. The clock gate controlled
 *  1: Force the clk pass clock gate
 */
#define LP_CLKRST_RTC_BLE_TIMER_APB_GATE    (BIT(27))
#define LP_CLKRST_RTC_BLE_TIMER_APB_GATE_M  (LP_CLKRST_RTC_BLE_TIMER_APB_GATE_V << LP_CLKRST_RTC_BLE_TIMER_APB_GATE_S)
#define LP_CLKRST_RTC_BLE_TIMER_APB_GATE_V  0x00000001U
#define LP_CLKRST_RTC_BLE_TIMER_APB_GATE_S  27
/** LP_CLKRST_TOTAL_CORE_EFUSE_GATE : R/W; bitpos: [28]; default: 1;
 *  Configures the clock gate to TOTAL_EFUSE_AON_CLK
 *  0: Invalid. The clock gate controlled by hardware fsm
 *  1: Force the clk pass clock gate
 */
#define LP_CLKRST_TOTAL_CORE_EFUSE_GATE    (BIT(28))
#define LP_CLKRST_TOTAL_CORE_EFUSE_GATE_M  (LP_CLKRST_TOTAL_CORE_EFUSE_GATE_V << LP_CLKRST_TOTAL_CORE_EFUSE_GATE_S)
#define LP_CLKRST_TOTAL_CORE_EFUSE_GATE_V  0x00000001U
#define LP_CLKRST_TOTAL_CORE_EFUSE_GATE_S  28
/** LP_CLKRST_AON_CORE_EFUSE_GATE : R/W; bitpos: [29]; default: 1;
 *  Configures the clock gate to CORE_EFUSE_AON_CLK
 *  0: Invalid. The clock gate controlled by hardware fsm
 *  1: Force the clk pass clock gate
 */
#define LP_CLKRST_AON_CORE_EFUSE_GATE    (BIT(29))
#define LP_CLKRST_AON_CORE_EFUSE_GATE_M  (LP_CLKRST_AON_CORE_EFUSE_GATE_V << LP_CLKRST_AON_CORE_EFUSE_GATE_S)
#define LP_CLKRST_AON_CORE_EFUSE_GATE_V  0x00000001U
#define LP_CLKRST_AON_CORE_EFUSE_GATE_S  29
/** LP_CLKRST_AON_TOUCH_GATE : R/W; bitpos: [30]; default: 1;
 *  Configures the clock gate to TOUCH_AON_CLK
 *  0: Invalid. The clock gate controlled by hardware fsm
 *  1: Force the clk pass clock gate
 */
#define LP_CLKRST_AON_TOUCH_GATE    (BIT(30))
#define LP_CLKRST_AON_TOUCH_GATE_M  (LP_CLKRST_AON_TOUCH_GATE_V << LP_CLKRST_AON_TOUCH_GATE_S)
#define LP_CLKRST_AON_TOUCH_GATE_V  0x00000001U
#define LP_CLKRST_AON_TOUCH_GATE_S  30
/** LP_CLKRST_FAST_ORI_GATE : R/W; bitpos: [31]; default: 0;
 *  Configures the clock gate to LP_FAST_CLK
 *  0: Invalid. The clock gate controlled by hardware fsm
 *  1: Force the clk pass clock gate
 */
#define LP_CLKRST_FAST_ORI_GATE    (BIT(31))
#define LP_CLKRST_FAST_ORI_GATE_M  (LP_CLKRST_FAST_ORI_GATE_V << LP_CLKRST_FAST_ORI_GATE_S)
#define LP_CLKRST_FAST_ORI_GATE_V  0x00000001U
#define LP_CLKRST_FAST_ORI_GATE_S  31

/** LP_CLKRST_LP_RST_EN_REG register
 *  Configures the peri of LP system software reset
 */
#define LP_CLKRST_LP_RST_EN_REG (DR_REG_LP_CLKRST_BASE + 0xc)
/** LP_CLKRST_HUK_RESET_EN : R/W; bitpos: [25]; default: 0;
 *  Configures whether or not to reset  HUK
 *  0: Invalid.No effect
 *  1: Reset
 */
#define LP_CLKRST_HUK_RESET_EN    (BIT(25))
#define LP_CLKRST_HUK_RESET_EN_M  (LP_CLKRST_HUK_RESET_EN_V << LP_CLKRST_HUK_RESET_EN_S)
#define LP_CLKRST_HUK_RESET_EN_V  0x00000001U
#define LP_CLKRST_HUK_RESET_EN_S  25
/** LP_CLKRST_AON_BLETIMER_RESET_EN : R/W; bitpos: [26]; default: 0;
 *  Configures whether or not to reset  bletimer  part
 *  0: Invalid.No effect
 *  1: Reset
 */
#define LP_CLKRST_AON_BLETIMER_RESET_EN    (BIT(26))
#define LP_CLKRST_AON_BLETIMER_RESET_EN_M  (LP_CLKRST_AON_BLETIMER_RESET_EN_V << LP_CLKRST_AON_BLETIMER_RESET_EN_S)
#define LP_CLKRST_AON_BLETIMER_RESET_EN_V  0x00000001U
#define LP_CLKRST_AON_BLETIMER_RESET_EN_S  26
/** LP_CLKRST_AON_TOUCH_RESET_EN : R/W; bitpos: [27]; default: 0;
 *  Configures whether or not to reset  TOUCH  part
 *  0: Invalid.No effect
 *  1: Reset
 */
#define LP_CLKRST_AON_TOUCH_RESET_EN    (BIT(27))
#define LP_CLKRST_AON_TOUCH_RESET_EN_M  (LP_CLKRST_AON_TOUCH_RESET_EN_V << LP_CLKRST_AON_TOUCH_RESET_EN_S)
#define LP_CLKRST_AON_TOUCH_RESET_EN_V  0x00000001U
#define LP_CLKRST_AON_TOUCH_RESET_EN_S  27
/** LP_CLKRST_AON_EFUSE_CORE_RESET_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to reset  EFUSE_CTRL always-on part
 *  0: Invalid.No effect
 *  1: Reset
 */
#define LP_CLKRST_AON_EFUSE_CORE_RESET_EN    (BIT(28))
#define LP_CLKRST_AON_EFUSE_CORE_RESET_EN_M  (LP_CLKRST_AON_EFUSE_CORE_RESET_EN_V << LP_CLKRST_AON_EFUSE_CORE_RESET_EN_S)
#define LP_CLKRST_AON_EFUSE_CORE_RESET_EN_V  0x00000001U
#define LP_CLKRST_AON_EFUSE_CORE_RESET_EN_S  28
/** LP_CLKRST_LP_TIMER_RESET_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether or not to reset  LP_TIMER
 *  0: Invalid.No effect
 *  1: Reset
 */
#define LP_CLKRST_LP_TIMER_RESET_EN    (BIT(29))
#define LP_CLKRST_LP_TIMER_RESET_EN_M  (LP_CLKRST_LP_TIMER_RESET_EN_V << LP_CLKRST_LP_TIMER_RESET_EN_S)
#define LP_CLKRST_LP_TIMER_RESET_EN_V  0x00000001U
#define LP_CLKRST_LP_TIMER_RESET_EN_S  29
/** LP_CLKRST_WDT_RESET_EN : R/W; bitpos: [30]; default: 0;
 *  Configures whether or not to reset LP_WDT and super watch dog
 *  0: Invalid.No effect
 *  1: Reset
 */
#define LP_CLKRST_WDT_RESET_EN    (BIT(30))
#define LP_CLKRST_WDT_RESET_EN_M  (LP_CLKRST_WDT_RESET_EN_V << LP_CLKRST_WDT_RESET_EN_S)
#define LP_CLKRST_WDT_RESET_EN_V  0x00000001U
#define LP_CLKRST_WDT_RESET_EN_S  30
/** LP_CLKRST_ANA_PERI_RESET_EN : R/W; bitpos: [31]; default: 0;
 *  Configures whether or not to reset analog peri, include brownout controller
 *  0: Invalid.No effect
 *  1: Reset
 */
#define LP_CLKRST_ANA_PERI_RESET_EN    (BIT(31))
#define LP_CLKRST_ANA_PERI_RESET_EN_M  (LP_CLKRST_ANA_PERI_RESET_EN_V << LP_CLKRST_ANA_PERI_RESET_EN_S)
#define LP_CLKRST_ANA_PERI_RESET_EN_V  0x00000001U
#define LP_CLKRST_ANA_PERI_RESET_EN_S  31

/** LP_CLKRST_RESET_CORE0_CAUSE_REG register
 *  Represents the reset cause
 */
#define LP_CLKRST_RESET_CORE0_CAUSE_REG (DR_REG_LP_CLKRST_BASE + 0x10)
/** LP_CLKRST_CORE0_RESET_CAUSE : RO; bitpos: [4:0]; default: 0;
 *  Represents the reset cause
 */
#define LP_CLKRST_CORE0_RESET_CAUSE    0x0000001FU
#define LP_CLKRST_CORE0_RESET_CAUSE_M  (LP_CLKRST_CORE0_RESET_CAUSE_V << LP_CLKRST_CORE0_RESET_CAUSE_S)
#define LP_CLKRST_CORE0_RESET_CAUSE_V  0x0000001FU
#define LP_CLKRST_CORE0_RESET_CAUSE_S  0
/** LP_CLKRST_CORE0_RESET_FLAG : RO; bitpos: [5]; default: 1;
 *  Represents the reset flag
 */
#define LP_CLKRST_CORE0_RESET_FLAG    (BIT(5))
#define LP_CLKRST_CORE0_RESET_FLAG_M  (LP_CLKRST_CORE0_RESET_FLAG_V << LP_CLKRST_CORE0_RESET_FLAG_S)
#define LP_CLKRST_CORE0_RESET_FLAG_V  0x00000001U
#define LP_CLKRST_CORE0_RESET_FLAG_S  5
/** LP_CLKRST_CORE0_RESET_CAUSE_CLR : WT; bitpos: [29]; default: 0;
 *  0: no operation
 */
#define LP_CLKRST_CORE0_RESET_CAUSE_CLR    (BIT(29))
#define LP_CLKRST_CORE0_RESET_CAUSE_CLR_M  (LP_CLKRST_CORE0_RESET_CAUSE_CLR_V << LP_CLKRST_CORE0_RESET_CAUSE_CLR_S)
#define LP_CLKRST_CORE0_RESET_CAUSE_CLR_V  0x00000001U
#define LP_CLKRST_CORE0_RESET_CAUSE_CLR_S  29
/** LP_CLKRST_CORE0_RESET_FLAG_SET : WT; bitpos: [30]; default: 0;
 *  configure set reset flag
 */
#define LP_CLKRST_CORE0_RESET_FLAG_SET    (BIT(30))
#define LP_CLKRST_CORE0_RESET_FLAG_SET_M  (LP_CLKRST_CORE0_RESET_FLAG_SET_V << LP_CLKRST_CORE0_RESET_FLAG_SET_S)
#define LP_CLKRST_CORE0_RESET_FLAG_SET_V  0x00000001U
#define LP_CLKRST_CORE0_RESET_FLAG_SET_S  30
/** LP_CLKRST_CORE0_RESET_FLAG_CLR : WT; bitpos: [31]; default: 0;
 *  configure clear reset flag
 *  0: no operation
 *  1: clear flag to 0
 */
#define LP_CLKRST_CORE0_RESET_FLAG_CLR    (BIT(31))
#define LP_CLKRST_CORE0_RESET_FLAG_CLR_M  (LP_CLKRST_CORE0_RESET_FLAG_CLR_V << LP_CLKRST_CORE0_RESET_FLAG_CLR_S)
#define LP_CLKRST_CORE0_RESET_FLAG_CLR_V  0x00000001U
#define LP_CLKRST_CORE0_RESET_FLAG_CLR_S  31

/** LP_CLKRST_RESET_CORE1_CAUSE_REG register
 *  Represents the reset cause
 */
#define LP_CLKRST_RESET_CORE1_CAUSE_REG (DR_REG_LP_CLKRST_BASE + 0x14)
/** LP_CLKRST_CORE1_RESET_CAUSE : RO; bitpos: [4:0]; default: 0;
 *  Represents the reset cause
 */
#define LP_CLKRST_CORE1_RESET_CAUSE    0x0000001FU
#define LP_CLKRST_CORE1_RESET_CAUSE_M  (LP_CLKRST_CORE1_RESET_CAUSE_V << LP_CLKRST_CORE1_RESET_CAUSE_S)
#define LP_CLKRST_CORE1_RESET_CAUSE_V  0x0000001FU
#define LP_CLKRST_CORE1_RESET_CAUSE_S  0
/** LP_CLKRST_CORE1_RESET_FLAG : RO; bitpos: [5]; default: 1;
 *  Represents the reset flag
 */
#define LP_CLKRST_CORE1_RESET_FLAG    (BIT(5))
#define LP_CLKRST_CORE1_RESET_FLAG_M  (LP_CLKRST_CORE1_RESET_FLAG_V << LP_CLKRST_CORE1_RESET_FLAG_S)
#define LP_CLKRST_CORE1_RESET_FLAG_V  0x00000001U
#define LP_CLKRST_CORE1_RESET_FLAG_S  5
/** LP_CLKRST_CORE1_RESET_CAUSE_CLR : WT; bitpos: [29]; default: 0;
 *  0: no operation
 */
#define LP_CLKRST_CORE1_RESET_CAUSE_CLR    (BIT(29))
#define LP_CLKRST_CORE1_RESET_CAUSE_CLR_M  (LP_CLKRST_CORE1_RESET_CAUSE_CLR_V << LP_CLKRST_CORE1_RESET_CAUSE_CLR_S)
#define LP_CLKRST_CORE1_RESET_CAUSE_CLR_V  0x00000001U
#define LP_CLKRST_CORE1_RESET_CAUSE_CLR_S  29
/** LP_CLKRST_CORE1_RESET_FLAG_SET : WT; bitpos: [30]; default: 0;
 *  configure set reset flag
 */
#define LP_CLKRST_CORE1_RESET_FLAG_SET    (BIT(30))
#define LP_CLKRST_CORE1_RESET_FLAG_SET_M  (LP_CLKRST_CORE1_RESET_FLAG_SET_V << LP_CLKRST_CORE1_RESET_FLAG_SET_S)
#define LP_CLKRST_CORE1_RESET_FLAG_SET_V  0x00000001U
#define LP_CLKRST_CORE1_RESET_FLAG_SET_S  30
/** LP_CLKRST_CORE1_RESET_FLAG_CLR : WT; bitpos: [31]; default: 0;
 *  configure clear reset flag
 *  0: no operation
 *  1: clear flag to 0
 */
#define LP_CLKRST_CORE1_RESET_FLAG_CLR    (BIT(31))
#define LP_CLKRST_CORE1_RESET_FLAG_CLR_M  (LP_CLKRST_CORE1_RESET_FLAG_CLR_V << LP_CLKRST_CORE1_RESET_FLAG_CLR_S)
#define LP_CLKRST_CORE1_RESET_FLAG_CLR_V  0x00000001U
#define LP_CLKRST_CORE1_RESET_FLAG_CLR_S  31

/** LP_CLKRST_CPU_CORE0_RESET_REG register
 *  Configures CPU reset
 */
#define LP_CLKRST_CPU_CORE0_RESET_REG (DR_REG_LP_CLKRST_BASE + 0x18)
/** LP_CLKRST_HPCORE0_LOCKUP_RESET_EN : R/W; bitpos: [21]; default: 1;
 *  configure the hpcore0 luckup reset enable
 *  0: disable
 *  1:enable
 */
#define LP_CLKRST_HPCORE0_LOCKUP_RESET_EN    (BIT(21))
#define LP_CLKRST_HPCORE0_LOCKUP_RESET_EN_M  (LP_CLKRST_HPCORE0_LOCKUP_RESET_EN_V << LP_CLKRST_HPCORE0_LOCKUP_RESET_EN_S)
#define LP_CLKRST_HPCORE0_LOCKUP_RESET_EN_V  0x00000001U
#define LP_CLKRST_HPCORE0_LOCKUP_RESET_EN_S  21
/** LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_LENGTH : R/W; bitpos: [24:22]; default: 1;
 *  configures the reset length of LP_WDT reset CPU
 *  Measurement unit: LP_DYN_FAST_CLK
 */
#define LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_LENGTH    0x00000007U
#define LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_LENGTH_M  (LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_LENGTH_V << LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_LENGTH_S)
#define LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_LENGTH_V  0x00000007U
#define LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_LENGTH_S  22
/** LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_EN : R/W; bitpos: [25]; default: 0;
 *  Configures whether or not LP_WDT can reset CPU
 *  0: LP_WDT could not reset CPU when LP_WDT timeout
 *  1: LP_WDT could reset CPU when LP_WDT timeout
 */
#define LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_EN    (BIT(25))
#define LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_EN_M  (LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_EN_V << LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_EN_S)
#define LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_EN_V  0x00000001U
#define LP_CLKRST_RTC_WDT_CPU_CORE0_RESET_EN_S  25
/** LP_CLKRST_CPU_CORE0_STALL_WAIT : R/W; bitpos: [30:26]; default: 1;
 *  configure the time between CPU stall and reset
 *  Measurement unit: LP_DYN_FAST_CLK
 */
#define LP_CLKRST_CPU_CORE0_STALL_WAIT    0x0000001FU
#define LP_CLKRST_CPU_CORE0_STALL_WAIT_M  (LP_CLKRST_CPU_CORE0_STALL_WAIT_V << LP_CLKRST_CPU_CORE0_STALL_WAIT_S)
#define LP_CLKRST_CPU_CORE0_STALL_WAIT_V  0x0000001FU
#define LP_CLKRST_CPU_CORE0_STALL_WAIT_S  26
/** LP_CLKRST_CPU_CORE0_STALL_EN : R/W; bitpos: [31]; default: 0;
 *  Configures whether or not CPU entry stall state before LP_WDT and software reset CPU
 *  0: CPU will not entry stall state before LP_WDT and software reset CPU
 *  1: CPU will entry stall state before LP_WDT and software reset CPU
 */
#define LP_CLKRST_CPU_CORE0_STALL_EN    (BIT(31))
#define LP_CLKRST_CPU_CORE0_STALL_EN_M  (LP_CLKRST_CPU_CORE0_STALL_EN_V << LP_CLKRST_CPU_CORE0_STALL_EN_S)
#define LP_CLKRST_CPU_CORE0_STALL_EN_V  0x00000001U
#define LP_CLKRST_CPU_CORE0_STALL_EN_S  31

/** LP_CLKRST_CPU_CORE1_RESET_REG register
 *  Configures CPU reset
 */
#define LP_CLKRST_CPU_CORE1_RESET_REG (DR_REG_LP_CLKRST_BASE + 0x1c)
/** LP_CLKRST_HPCORE1_LOCKUP_RESET_EN : R/W; bitpos: [21]; default: 1;
 *  configure the hpcore0 luckup reset enable
 *  0: disable
 *  1:enable
 */
#define LP_CLKRST_HPCORE1_LOCKUP_RESET_EN    (BIT(21))
#define LP_CLKRST_HPCORE1_LOCKUP_RESET_EN_M  (LP_CLKRST_HPCORE1_LOCKUP_RESET_EN_V << LP_CLKRST_HPCORE1_LOCKUP_RESET_EN_S)
#define LP_CLKRST_HPCORE1_LOCKUP_RESET_EN_V  0x00000001U
#define LP_CLKRST_HPCORE1_LOCKUP_RESET_EN_S  21
/** LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_LENGTH : R/W; bitpos: [24:22]; default: 1;
 *  configures the reset length of LP_WDT reset CPU
 *  Measurement unit: LP_DYN_FAST_CLK
 */
#define LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_LENGTH    0x00000007U
#define LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_LENGTH_M  (LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_LENGTH_V << LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_LENGTH_S)
#define LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_LENGTH_V  0x00000007U
#define LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_LENGTH_S  22
/** LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_EN : R/W; bitpos: [25]; default: 0;
 *  Configures whether or not LP_WDT can reset CPU
 *  0: LP_WDT could not reset CPU when LP_WDT timeout
 *  1: LP_WDT could reset CPU when LP_WDT timeout
 */
#define LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_EN    (BIT(25))
#define LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_EN_M  (LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_EN_V << LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_EN_S)
#define LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_EN_V  0x00000001U
#define LP_CLKRST_RTC_WDT_CPU_CORE1_RESET_EN_S  25
/** LP_CLKRST_CPU_CORE1_STALL_WAIT : R/W; bitpos: [30:26]; default: 1;
 *  configure the time between CPU stall and reset
 *  Measurement unit: LP_DYN_FAST_CLK
 */
#define LP_CLKRST_CPU_CORE1_STALL_WAIT    0x0000001FU
#define LP_CLKRST_CPU_CORE1_STALL_WAIT_M  (LP_CLKRST_CPU_CORE1_STALL_WAIT_V << LP_CLKRST_CPU_CORE1_STALL_WAIT_S)
#define LP_CLKRST_CPU_CORE1_STALL_WAIT_V  0x0000001FU
#define LP_CLKRST_CPU_CORE1_STALL_WAIT_S  26
/** LP_CLKRST_CPU_CORE1_STALL_EN : R/W; bitpos: [31]; default: 0;
 *  Configures whether or not CPU entry stall state before LP_WDT and software reset CPU
 *  0: CPU will not entry stall state before LP_WDT and software reset CPU
 *  1: CPU will entry stall state before LP_WDT and software reset CPU
 */
#define LP_CLKRST_CPU_CORE1_STALL_EN    (BIT(31))
#define LP_CLKRST_CPU_CORE1_STALL_EN_M  (LP_CLKRST_CPU_CORE1_STALL_EN_V << LP_CLKRST_CPU_CORE1_STALL_EN_S)
#define LP_CLKRST_CPU_CORE1_STALL_EN_V  0x00000001U
#define LP_CLKRST_CPU_CORE1_STALL_EN_S  31

