espressif/esp-idf/components/soc/esp32h4/register/soc/lp_clkrst_reg.h
/** LP_CLKRST_FOSC_CNTL_REG register
 *  Configures the RC_FAST_CLK frequency
 */
#define LP_CLKRST_FOSC_CNTL_REG (DR_REG_LP_CLKRST_BASE + 0x20)
/** LP_CLKRST_FOSC_DFREQ : R/W; bitpos: [31:22]; default: 547;
 *  Configures the RC_FAST_CLK frequency,the clock frequency will increase with this
 *  field
 */
#define LP_CLKRST_FOSC_DFREQ    0x000003FFU
#define LP_CLKRST_FOSC_DFREQ_M  (LP_CLKRST_FOSC_DFREQ_V << LP_CLKRST_FOSC_DFREQ_S)
#define LP_CLKRST_FOSC_DFREQ_V  0x000003FFU
#define LP_CLKRST_FOSC_DFREQ_S  22

/** LP_CLKRST_SOSC_CNTL_REG register
 *  Configures the RC_SLOW_CLK frequency
 */
#define LP_CLKRST_SOSC_CNTL_REG (DR_REG_LP_CLKRST_BASE + 0x24)
/** LP_CLKRST_SLOW_DFREQ : R/W; bitpos: [31:26]; default: 10;
 *  Configures the RC_SLOW_CLK frequency,the clock frequency will increase with this
 *  field
 */
#define LP_CLKRST_SLOW_DFREQ    0x0000003FU
#define LP_CLKRST_SLOW_DFREQ_M  (LP_CLKRST_SLOW_DFREQ_V << LP_CLKRST_SLOW_DFREQ_S)
#define LP_CLKRST_SLOW_DFREQ_V  0x0000003FU
#define LP_CLKRST_SLOW_DFREQ_S  26

/** LP_CLKRST_RC32K_CNTL_REG register
 *  Configures the RC32K_CLK frequency
 */
#define LP_CLKRST_RC32K_CNTL_REG (DR_REG_LP_CLKRST_BASE + 0x28)
/** LP_CLKRST_RC32K_DFREQ : R/W; bitpos: [31:22]; default: 172;
 *  Configures the RC32K_CLK frequency, the clock frequency will increase with this
 *  field
 */
#define LP_CLKRST_RC32K_DFREQ    0x000003FFU
#define LP_CLKRST_RC32K_DFREQ_M  (LP_CLKRST_RC32K_DFREQ_V << LP_CLKRST_RC32K_DFREQ_S)
#define LP_CLKRST_RC32K_DFREQ_V  0x000003FFU
#define LP_CLKRST_RC32K_DFREQ_S  22

/** LP_CLKRST_CLK_TO_HP_REG register
 *  Configures the clk gate of LP clk to HP system
 */
#define LP_CLKRST_CLK_TO_HP_REG (DR_REG_LP_CLKRST_BASE + 0x2c)
/** LP_CLKRST_CLK_PWR_FOSC_EN : R/W; bitpos: [25]; default: 1;
 *  Configures the clock gate to modem of the fosc clk.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_CLK_PWR_FOSC_EN    (BIT(25))
#define LP_CLKRST_CLK_PWR_FOSC_EN_M  (LP_CLKRST_CLK_PWR_FOSC_EN_V << LP_CLKRST_CLK_PWR_FOSC_EN_S)
#define LP_CLKRST_CLK_PWR_FOSC_EN_V  0x00000001U
#define LP_CLKRST_CLK_PWR_FOSC_EN_S  25
/** LP_CLKRST_CLK_PWR_XTAL_EN : R/W; bitpos: [26]; default: 1;
 *  Configures the clock gate to modem of the xtal clk.
 *  0: Disable the clk pass clock gate
 *  1: Enable the clk pass clock gate
 */
#define LP_CLKRST_CLK_PWR_XTAL_EN    (BIT(26))
#define LP_CLKRST_CLK_PWR_XTAL_EN_M  (LP_CLKRST_CLK_PWR_XTAL_EN_V << LP_CLKRST_CLK_PWR_XTAL_EN_S)
#define LP_CLKRST_CLK_PWR_XTAL_EN_V  0x00000001U
#define LP_CLKRST_CLK_PWR_XTAL_EN_S  26
/** LP_CLKRST_ICG_HP_XTAL32K : R/W; bitpos: [28]; default: 1;
 *  Configures the clk gate of XTAL32K_CLK to HP system
 *  0: The clk could not pass to HP system
 *  1: The clk could pass to HP system
 */
#define LP_CLKRST_ICG_HP_XTAL32K    (BIT(28))
#define LP_CLKRST_ICG_HP_XTAL32K_M  (LP_CLKRST_ICG_HP_XTAL32K_V << LP_CLKRST_ICG_HP_XTAL32K_S)
#define LP_CLKRST_ICG_HP_XTAL32K_V  0x00000001U
#define LP_CLKRST_ICG_HP_XTAL32K_S  28
/** LP_CLKRST_ICG_HP_SOSC : R/W; bitpos: [29]; default: 1;
 *  Configures the clk gate of RC_SLOW_CLK to HP system
 *  0: The clk could not pass to HP system
 *  1: The clk could pass to HP system
 */
#define LP_CLKRST_ICG_HP_SOSC    (BIT(29))
#define LP_CLKRST_ICG_HP_SOSC_M  (LP_CLKRST_ICG_HP_SOSC_V << LP_CLKRST_ICG_HP_SOSC_S)
#define LP_CLKRST_ICG_HP_SOSC_V  0x00000001U
#define LP_CLKRST_ICG_HP_SOSC_S  29
/** LP_CLKRST_ICG_HP_OSC32K : R/W; bitpos: [30]; default: 1;
 *  Configures the clk gate of RC32K_CLK to HP system
 *  0: The clk could not pass to HP system
 *  1: The clk could pass to HP system
 */
#define LP_CLKRST_ICG_HP_OSC32K    (BIT(30))
#define LP_CLKRST_ICG_HP_OSC32K_M  (LP_CLKRST_ICG_HP_OSC32K_V << LP_CLKRST_ICG_HP_OSC32K_S)
#define LP_CLKRST_ICG_HP_OSC32K_V  0x00000001U
#define LP_CLKRST_ICG_HP_OSC32K_S  30
/** LP_CLKRST_ICG_HP_FOSC : R/W; bitpos: [31]; default: 1;
 *  Configures the clk gate of RC_FAST_CLK to HP system
 *  0: The clk could not pass to HP system
 *  1: The clk could pass to HP system
 */
#define LP_CLKRST_ICG_HP_FOSC    (BIT(31))
#define LP_CLKRST_ICG_HP_FOSC_M  (LP_CLKRST_ICG_HP_FOSC_V << LP_CLKRST_ICG_HP_FOSC_S)
#define LP_CLKRST_ICG_HP_FOSC_V  0x00000001U
#define LP_CLKRST_ICG_HP_FOSC_S  31

/** LP_CLKRST_LPMEM_FORCE_REG register
 *  Configures the LP_MEM clk gate force parameter
 */
#define LP_CLKRST_LPMEM_FORCE_REG (DR_REG_LP_CLKRST_BASE + 0x30)
/** LP_CLKRST_LPMEM_CLK_FORCE_ON : R/W; bitpos: [31]; default: 0;
 *  Configures whether ot not force open the clock gate of LP MEM
 *  0: Invalid. The clock gate controlled by hardware FSM
 *  1: Force open clock gate of LP MEM
 */
#define LP_CLKRST_LPMEM_CLK_FORCE_ON    (BIT(31))
#define LP_CLKRST_LPMEM_CLK_FORCE_ON_M  (LP_CLKRST_LPMEM_CLK_FORCE_ON_V << LP_CLKRST_LPMEM_CLK_FORCE_ON_S)
#define LP_CLKRST_LPMEM_CLK_FORCE_ON_V  0x00000001U
#define LP_CLKRST_LPMEM_CLK_FORCE_ON_S  31

/** LP_CLKRST_XTAL32K_REG register
 *  Configures the XTAL32K parameter
 */
#define LP_CLKRST_XTAL32K_REG (DR_REG_LP_CLKRST_BASE + 0x34)
/** LP_CLKRST_RTC_SEL_POWER_XTAL32K : R/W; bitpos: [21]; default: 0;
 *  need_des
 */
#define LP_CLKRST_RTC_SEL_POWER_XTAL32K    (BIT(21))
#define LP_CLKRST_RTC_SEL_POWER_XTAL32K_M  (LP_CLKRST_RTC_SEL_POWER_XTAL32K_V << LP_CLKRST_RTC_SEL_POWER_XTAL32K_S)
#define LP_CLKRST_RTC_SEL_POWER_XTAL32K_V  0x00000001U
#define LP_CLKRST_RTC_SEL_POWER_XTAL32K_S  21
/** LP_CLKRST_DRES_XTAL32K : R/W; bitpos: [24:22]; default: 3;
 *  Configures DRES
 */
#define LP_CLKRST_DRES_XTAL32K    0x00000007U
#define LP_CLKRST_DRES_XTAL32K_M  (LP_CLKRST_DRES_XTAL32K_V << LP_CLKRST_DRES_XTAL32K_S)
#define LP_CLKRST_DRES_XTAL32K_V  0x00000007U
#define LP_CLKRST_DRES_XTAL32K_S  22
/** LP_CLKRST_DGM_XTAL32K : R/W; bitpos: [27:25]; default: 3;
 *  Configures DGM
 */
#define LP_CLKRST_DGM_XTAL32K    0x00000007U
#define LP_CLKRST_DGM_XTAL32K_M  (LP_CLKRST_DGM_XTAL32K_V << LP_CLKRST_DGM_XTAL32K_S)
#define LP_CLKRST_DGM_XTAL32K_V  0x00000007U
#define LP_CLKRST_DGM_XTAL32K_S  25
/** LP_CLKRST_DBUF_XTAL32K : R/W; bitpos: [28]; default: 0;
 *  Configures DBUF
 */
#define LP_CLKRST_DBUF_XTAL32K    (BIT(28))
#define LP_CLKRST_DBUF_XTAL32K_M  (LP_CLKRST_DBUF_XTAL32K_V << LP_CLKRST_DBUF_XTAL32K_S)
#define LP_CLKRST_DBUF_XTAL32K_V  0x00000001U
#define LP_CLKRST_DBUF_XTAL32K_S  28
/** LP_CLKRST_DAC_XTAL32K : R/W; bitpos: [31:29]; default: 3;
 *  Configures DAC
 */
#define LP_CLKRST_DAC_XTAL32K    0x00000007U
#define LP_CLKRST_DAC_XTAL32K_M  (LP_CLKRST_DAC_XTAL32K_V << LP_CLKRST_DAC_XTAL32K_S)
#define LP_CLKRST_DAC_XTAL32K_V  0x00000007U
#define LP_CLKRST_DAC_XTAL32K_S  29

/** LP_CLKRST_CALI0_REG register
 *  need_des
 */
#define LP_CLKRST_CALI0_REG (DR_REG_LP_CLKRST_BASE + 0x38)
/** LP_CLKRST_LP_CALI_DIV_CYCLE : R/W; bitpos: [7:0]; default: 1;
 *  need_des
 */
#define LP_CLKRST_LP_CALI_DIV_CYCLE    0x000000FFU
#define LP_CLKRST_LP_CALI_DIV_CYCLE_M  (LP_CLKRST_LP_CALI_DIV_CYCLE_V << LP_CLKRST_LP_CALI_DIV_CYCLE_S)
#define LP_CLKRST_LP_CALI_DIV_CYCLE_V  0x000000FFU
#define LP_CLKRST_LP_CALI_DIV_CYCLE_S  0
/** LP_CLKRST_LP_CALI_FULL_CNT_DONE : RO; bitpos: [8]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_CALI_FULL_CNT_DONE    (BIT(8))
#define LP_CLKRST_LP_CALI_FULL_CNT_DONE_M  (LP_CLKRST_LP_CALI_FULL_CNT_DONE_V << LP_CLKRST_LP_CALI_FULL_CNT_DONE_S)
#define LP_CLKRST_LP_CALI_FULL_CNT_DONE_V  0x00000001U
#define LP_CLKRST_LP_CALI_FULL_CNT_DONE_S  8
/** LP_CLKRST_LP_CALI_DIV_CALI_CNT : RO; bitpos: [24:9]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_CALI_DIV_CALI_CNT    0x0000FFFFU
#define LP_CLKRST_LP_CALI_DIV_CALI_CNT_M  (LP_CLKRST_LP_CALI_DIV_CALI_CNT_V << LP_CLKRST_LP_CALI_DIV_CALI_CNT_S)
#define LP_CLKRST_LP_CALI_DIV_CALI_CNT_V  0x0000FFFFU
#define LP_CLKRST_LP_CALI_DIV_CALI_CNT_S  9
/** LP_CLKRST_LP_CALI_DIV_NUMERATOR_TYPE : RO; bitpos: [25]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_CALI_DIV_NUMERATOR_TYPE    (BIT(25))
#define LP_CLKRST_LP_CALI_DIV_NUMERATOR_TYPE_M  (LP_CLKRST_LP_CALI_DIV_NUMERATOR_TYPE_V << LP_CLKRST_LP_CALI_DIV_NUMERATOR_TYPE_S)
#define LP_CLKRST_LP_CALI_DIV_NUMERATOR_TYPE_V  0x00000001U
#define LP_CLKRST_LP_CALI_DIV_NUMERATOR_TYPE_S  25
/** LP_CLKRST_LP_CALI_DIV_NUM : RO; bitpos: [31:26]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_CALI_DIV_NUM    0x0000003FU
#define LP_CLKRST_LP_CALI_DIV_NUM_M  (LP_CLKRST_LP_CALI_DIV_NUM_V << LP_CLKRST_LP_CALI_DIV_NUM_S)
#define LP_CLKRST_LP_CALI_DIV_NUM_V  0x0000003FU
#define LP_CLKRST_LP_CALI_DIV_NUM_S  26

/** LP_CLKRST_CALI1_REG register
 *  need_des
 */
#define LP_CLKRST_CALI1_REG (DR_REG_LP_CLKRST_BASE + 0x3c)
/** LP_CLKRST_LP_CALI_DIV_NUMERATOR : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_CALI_DIV_NUMERATOR    0x0000FFFFU
#define LP_CLKRST_LP_CALI_DIV_NUMERATOR_M  (LP_CLKRST_LP_CALI_DIV_NUMERATOR_V << LP_CLKRST_LP_CALI_DIV_NUMERATOR_S)
#define LP_CLKRST_LP_CALI_DIV_NUMERATOR_V  0x0000FFFFU
#define LP_CLKRST_LP_CALI_DIV_NUMERATOR_S  0
/** LP_CLKRST_LP_CALI_DIV_DENOMINATOR : RO; bitpos: [31:16]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_CALI_DIV_DENOMINATOR    0x0000FFFFU
#define LP_CLKRST_LP_CALI_DIV_DENOMINATOR_M  (LP_CLKRST_LP_CALI_DIV_DENOMINATOR_V << LP_CLKRST_LP_CALI_DIV_DENOMINATOR_S)
#define LP_CLKRST_LP_CALI_DIV_DENOMINATOR_V  0x0000FFFFU
#define LP_CLKRST_LP_CALI_DIV_DENOMINATOR_S  16

