espressif/esp-idf/components/soc/esp32h4/register/soc/lp_clkrst_reg.h
/** LP_CLKRST_CALI2_REG register
 *  need_des
 */
#define LP_CLKRST_CALI2_REG (DR_REG_LP_CLKRST_BASE + 0x40)
/** LP_CLKRST_LP_CALI_DIV_WAIT_PWR_GOOD : R/W; bitpos: [8:0]; default: 255;
 *  need_des
 */
#define LP_CLKRST_LP_CALI_DIV_WAIT_PWR_GOOD    0x000001FFU
#define LP_CLKRST_LP_CALI_DIV_WAIT_PWR_GOOD_M  (LP_CLKRST_LP_CALI_DIV_WAIT_PWR_GOOD_V << LP_CLKRST_LP_CALI_DIV_WAIT_PWR_GOOD_S)
#define LP_CLKRST_LP_CALI_DIV_WAIT_PWR_GOOD_V  0x000001FFU
#define LP_CLKRST_LP_CALI_DIV_WAIT_PWR_GOOD_S  0
/** LP_CLKRST_LP_CALI_DIV_SLP_VAL : R/W; bitpos: [30:15]; default: 1;
 *  need_des
 */
#define LP_CLKRST_LP_CALI_DIV_SLP_VAL    0x0000FFFFU
#define LP_CLKRST_LP_CALI_DIV_SLP_VAL_M  (LP_CLKRST_LP_CALI_DIV_SLP_VAL_V << LP_CLKRST_LP_CALI_DIV_SLP_VAL_S)
#define LP_CLKRST_LP_CALI_DIV_SLP_VAL_V  0x0000FFFFU
#define LP_CLKRST_LP_CALI_DIV_SLP_VAL_S  15
/** LP_CLKRST_LP_CALI_DIV_TIMER_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_CALI_DIV_TIMER_EN    (BIT(31))
#define LP_CLKRST_LP_CALI_DIV_TIMER_EN_M  (LP_CLKRST_LP_CALI_DIV_TIMER_EN_V << LP_CLKRST_LP_CALI_DIV_TIMER_EN_S)
#define LP_CLKRST_LP_CALI_DIV_TIMER_EN_V  0x00000001U
#define LP_CLKRST_LP_CALI_DIV_TIMER_EN_S  31

/** LP_CLKRST_LPPERI_REG register
 *  need_des
 */
#define LP_CLKRST_LPPERI_REG (DR_REG_LP_CLKRST_BASE + 0x44)
/** LP_CLKRST_HUK_CLK_SEL : R/W; bitpos: [11]; default: 1;
 *  Configures the source clk of HUK
 *  0: 0: RC_FAST_CLK
 *  1: XTAL_D2_CLK
 */
#define LP_CLKRST_HUK_CLK_SEL    (BIT(11))
#define LP_CLKRST_HUK_CLK_SEL_M  (LP_CLKRST_HUK_CLK_SEL_V << LP_CLKRST_HUK_CLK_SEL_S)
#define LP_CLKRST_HUK_CLK_SEL_V  0x00000001U
#define LP_CLKRST_HUK_CLK_SEL_S  11
/** LP_CLKRST_LP_BLETIMER_DIV_NUM : R/W; bitpos: [23:12]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_BLETIMER_DIV_NUM    0x00000FFFU
#define LP_CLKRST_LP_BLETIMER_DIV_NUM_M  (LP_CLKRST_LP_BLETIMER_DIV_NUM_V << LP_CLKRST_LP_BLETIMER_DIV_NUM_S)
#define LP_CLKRST_LP_BLETIMER_DIV_NUM_V  0x00000FFFU
#define LP_CLKRST_LP_BLETIMER_DIV_NUM_S  12
/** LP_CLKRST_LP_BLETIMER_32K_SEL : R/W; bitpos: [25:24]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_BLETIMER_32K_SEL    0x00000003U
#define LP_CLKRST_LP_BLETIMER_32K_SEL_M  (LP_CLKRST_LP_BLETIMER_32K_SEL_V << LP_CLKRST_LP_BLETIMER_32K_SEL_S)
#define LP_CLKRST_LP_BLETIMER_32K_SEL_V  0x00000003U
#define LP_CLKRST_LP_BLETIMER_32K_SEL_S  24
/** LP_CLKRST_LP_SEL_OSC_SLOW : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_SEL_OSC_SLOW    (BIT(26))
#define LP_CLKRST_LP_SEL_OSC_SLOW_M  (LP_CLKRST_LP_SEL_OSC_SLOW_V << LP_CLKRST_LP_SEL_OSC_SLOW_S)
#define LP_CLKRST_LP_SEL_OSC_SLOW_V  0x00000001U
#define LP_CLKRST_LP_SEL_OSC_SLOW_S  26
/** LP_CLKRST_LP_SEL_OSC_FAST : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_SEL_OSC_FAST    (BIT(27))
#define LP_CLKRST_LP_SEL_OSC_FAST_M  (LP_CLKRST_LP_SEL_OSC_FAST_V << LP_CLKRST_LP_SEL_OSC_FAST_S)
#define LP_CLKRST_LP_SEL_OSC_FAST_V  0x00000001U
#define LP_CLKRST_LP_SEL_OSC_FAST_S  27
/** LP_CLKRST_LP_SEL_XTAL : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_SEL_XTAL    (BIT(28))
#define LP_CLKRST_LP_SEL_XTAL_M  (LP_CLKRST_LP_SEL_XTAL_V << LP_CLKRST_LP_SEL_XTAL_S)
#define LP_CLKRST_LP_SEL_XTAL_V  0x00000001U
#define LP_CLKRST_LP_SEL_XTAL_S  28
/** LP_CLKRST_LP_SEL_XTAL32K : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_CLKRST_LP_SEL_XTAL32K    (BIT(29))
#define LP_CLKRST_LP_SEL_XTAL32K_M  (LP_CLKRST_LP_SEL_XTAL32K_V << LP_CLKRST_LP_SEL_XTAL32K_S)
#define LP_CLKRST_LP_SEL_XTAL32K_V  0x00000001U
#define LP_CLKRST_LP_SEL_XTAL32K_S  29

/** LP_CLKRST_DATE_REG register
 *  Version control register
 */
#define LP_CLKRST_DATE_REG (DR_REG_LP_CLKRST_BASE + 0x3fc)
/** LP_CLKRST_CLKRST_DATE : R/W; bitpos: [30:0]; default: 37818640;
 *  Version control register
 */
#define LP_CLKRST_CLKRST_DATE    0x7FFFFFFFU
#define LP_CLKRST_CLKRST_DATE_M  (LP_CLKRST_CLKRST_DATE_V << LP_CLKRST_CLKRST_DATE_S)
#define LP_CLKRST_CLKRST_DATE_V  0x7FFFFFFFU
#define LP_CLKRST_CLKRST_DATE_S  0
/** LP_CLKRST_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  configure register clk bypass clk gate
 */
#define LP_CLKRST_CLK_EN    (BIT(31))
#define LP_CLKRST_CLK_EN_M  (LP_CLKRST_CLK_EN_V << LP_CLKRST_CLK_EN_S)
#define LP_CLKRST_CLK_EN_V  0x00000001U
#define LP_CLKRST_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
